Функция АвтомобилиЗагрузить() Экспорт
	
	Рез = "ошибка";
	
	ПараметрыСоединения = ОбщегоНазначения.НепереодическийПараметр("ОУ_ПараметрыСоединения");
	Если ПараметрыСоединения = "ошибка" Тогда
		Возврат Рез;
	КонецЕсли;
	
	БИ = ОбщегоНазначения.ПолучитьПодключениеБД(ПараметрыСоединения);
	Если  БИ = Неопределено Тогда
		Рез = "Ошибка подключения к информационной базе";
		ЗаписьЖурналаРегистрации("АвтомобилиЗагрузить", УровеньЖурналаРегистрации.Ошибка,, СтрШаблон("Параметры соединения = %1", ПараметрыСоединения), Рез);
		Возврат Рез;
	КонецЕсли;
	
	//СуществующиеВины = Новый Массив();
	//Запрос = Новый Запрос("ВЫБРАТЬ Т.vin КАК vin ИЗ ВнешнийИсточникДанных.А.Таблица.vehicle КАК Т");
	//РезультатЗапроса = Запрос.Выполнить();
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	СуществующиеВины = РезультатЗапроса.Выгрузить()[0][0]; 
	//КонецЕсли;
	//СуществующиеВины.Добавить("");
	
	БИ_СуществующиеВины = БИ.NewObject("Массив");;
	Запрос = Новый Запрос("ВЫБРАТЬ Т.vin КАК vin ИЗ ВнешнийИсточникДанных.А.Таблица.vehicle КАК Т");
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			БИ_СуществующиеВины.Добавить(Выборка.vin);	
		КонецЦикла;
	КонецЕсли;
	БИ_СуществующиеВины.Добавить("");

	НаибИд = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ ЕСТЬNULL(МАКСИМУМ(Т.id),0) КАК id1 ИЗ ВнешнийИсточникДанных.А.Таблица.vehicle КАК Т");
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		НаибИд = РезультатЗапроса.Выгрузить()[0][0]; 	
	КонецЕсли;
	
	БИ_Запрос = БИ.NewObject("Запрос");
	БИ_Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	НомерныеЭлементы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	Справочник.НомерныеЭлементы КАК НомерныеЭлементы
	|ГДЕ
	|    НомерныеЭлементы.ЭтоАгрегат = ЛОЖЬ
	|		И НЕ НомерныеЭлементы.НомерВин В (&СуществующиеВины)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Основание КАК Основание,
	|	Т.СвойствоТип.Наименование КАК СвойствоТип,
	|	Т.СвойствоЗначение КАК СвойствоЗначение
	|ПОМЕСТИТЬ Свойства
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствАвтомобилей.СрезПоследних(
	|			,
	|			Основание В
	|				(ВЫБРАТЬ
	|					ВТ1.Ссылка
	|				ИЗ
	|					ВТ1)) КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.Ссылка КАК Ссылка,
	|	ВТ1.Ссылка.Наименование КАК Наименование,
	|	ВТ1.Ссылка.Год КАК Год,
	|	ВТ1.Ссылка.Цвет.Наименование КАК Цвет,
	|	ВТ1.Ссылка.Модель.Наименование КАК МодельНаименование,
	|	ВТ1.Ссылка.ГосНомер КАК ГосНомер,
	|	ВТ1.Ссылка.НомерВин КАК НомерВин,
	|	ВТ1.Ссылка.МодельПоПаспорту КАК МодельПоПаспорту,
	|	ЕСТЬNULL(С1.СвойствоЗначение, 0) КАК Пробег
	|ИЗ
	|	ВТ1 КАК ВТ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Свойства КАК С1
	|		ПО ВТ1.Ссылка = С1.Основание
	|			И (С1.СвойствоЗначение = ЗНАЧЕНИЕ(Справочник.СвойстваАвтомобилей.Пробег))";
	

	БИ_Запрос.УстановитьПараметр("СуществующиеВины", БИ_СуществующиеВины);
	БИ_РезультатЗапроса = БИ_Запрос.Выполнить();
	Если БИ_РезультатЗапроса.Пустой() Тогда
		Возврат "предупреждение: пустой результат запроса по автмобилям";
	КонецЕсли;
	БИ_Выборка = БИ_РезультатЗапроса.Выбрать();
	
	Ид = НаибИд;
	ТекДата = ТекущаяДата();
	Пока БИ_Выборка.Следующий() Цикл
		Ид = Ид+1;
		Зап = ВнешниеИсточникиДанных.А.Таблицы.vehicle.СоздатьОбъект();
		Зап.id			= Ид;
		Зап.vin			= БИ_Выборка.НомерВин;
		Зап.model 		= БИ_Выборка.МодельНаименование;
		Зап.run			= Число(БИ_Выборка.Пробег);
		Зап.year 		= БИ_Выборка.Год;		
		Зап.color 		= БИ_Выборка.Цвет;
		Зап.timestamp 	= ТекДата;
		Зап.ref1C		= БИ.xmlСтрока(БИ_Выборка.Ссылка);
		Зап.Записать();
	КонецЦикла;
	
КонецФункции