Функция ПолучитьПодключениеБД(ПараметрыСоединения) Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Неопределено;
	
	Доступно = ТипЗнч(ПараметрыСоединения) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(ПараметрыСоединения);
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	Данные = ПараметрыСоединения;
	
	V83COMConnector= Новый COMОбъект("V83.COMConnector");
	Попытка
		Возврат V83COMConnector.Connect(ПараметрыСоединения);
	Исключение
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ПолучитьПодключениеБД()", УровеньЖурналаРегистрации.Ошибка, , Данные, Комментарий);
	КонецПопытки;	
КонецФункции

Функция НепереодическийПараметр(Имя) Экспорт
	//Возвращает значение непереодического параметра по его имени
	//------------------------------------------------------------
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Имя) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Имя);
	Если Не Доступно Тогда
		Возврат "ошибка";
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Т.Значение КАК Значение ИЗ РегистрСведений.НепереодическиеПараметры КАК Т ГДЕ Т.Ид = &Ид");
	Запрос.УстановитьПараметр("Ид", Имя);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "ошибка";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Значение;
КонецФункции
	
